Revit 2027 API
ComputationDataFor3DPathSet.CreateFromRebar Method
 Creates a new instance of the ComputationDataFor3DPathSet class from the provided Rebar element.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ComputationDataFor3DPathSet CreateFromRebar(
	Rebar rebar,
	int barPositionIndex
)
Public Shared Function CreateFromRebar (
	rebar As Rebar,
	barPositionIndex As Integer
) As ComputationDataFor3DPathSet
public:
static ComputationDataFor3DPathSet^ CreateFromRebar(
	Rebar^ rebar,
	int barPositionIndex
)
static member CreateFromRebar :
        rebar : Rebar *
        barPositionIndex : int -> ComputationDataFor3DPathSet
Parameters
rebar Rebar
 The rebar element from which the data will be obtained.
barPositionIndex Int32
 The index of the bar. Should be a number between 0 and Rebar.NumberOfBarPositions - 1.
Return Value
ComputationDataFor3DPathSet
 Returns a new instance of the ComputationDataFor3DPathSet class.
Exceptions
Exception | Condition
ArgumentException |  barPositionIndex should be a number between 0 and Rebar.NumberOfBarPositions - 1. -or- rebar should have coplanar curves.
ArgumentNullException |  A non-optional argument was null
Remarks
 When setting the data from a rebar, the curves are extracted from the bar at index barPositionIndex. The terminations in the 3D Path set will be oriented similarly to the terminations in the rebar.
See Also
Reference
ComputationDataFor3DPathSet Class
Autodesk.Revit.DB.Structure Namespace